-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 11 2018 г., 23:49
-- Версия сервера: 5.7.19
-- Версия PHP: 5.6.31

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `school_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `accounts`
--

DROP TABLE IF EXISTS `accounts`;
CREATE TABLE IF NOT EXISTS `accounts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login` varchar(40) NOT NULL,
  `password` int(32) DEFAULT NULL,
  `perks` int(4) NOT NULL,
  `active` int(2) DEFAULT NULL,
  `session_key` varchar(16) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=11223345 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `accounts`
--

INSERT INTO `accounts` (`id`, `login`, `password`, `perks`, `active`, `session_key`) VALUES
(1, 'admin', 25101996, 0, 1, '20CilqBEfCer8cni'),
(2, '999', 111, 0, 0, ''),
(3, '6565', 111, 0, 1, '4LRZ34KANC8UtOi7'),
(4, '3434', 123, 0, 0, '');

-- --------------------------------------------------------

--
-- Структура таблицы `employees`
--

DROP TABLE IF EXISTS `employees`;
CREATE TABLE IF NOT EXISTS `employees` (
  `id` int(5) NOT NULL AUTO_INCREMENT,
  `First_name1` varchar(30) CHARACTER SET utf8 NOT NULL,
  `Second_name1` varchar(35) CHARACTER SET utf8 NOT NULL,
  `Age` int(3) NOT NULL,
  `Position` varchar(40) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1025 DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `employees`
--

INSERT INTO `employees` (`id`, `First_name1`, `Second_name1`, `Age`, `Position`) VALUES
(1001, 'Галина', 'Галухо', 45, 'директор'),
(1002, 'Ольга', 'Петрова', 42, 'завуч по учебной части'),
(1003, 'Александра', 'Кахонова', 39, 'завуч по ИКТ'),
(1004, 'Дмитрий', 'Петров', 44, 'учитель физической культуры'),
(1005, 'Галина', 'Петрова', 44, 'учитель русского языка и литературы'),
(1006, 'Станислав', 'Яковлев', 45, 'учитель истории'),
(1007, 'Евгения', 'Твердолобова', 47, 'учитель математики'),
(1008, 'Александра', 'Прыткина', 27, 'учитель английского языка'),
(1009, 'Нелли', 'Акбар', 43, 'учитель французского языка'),
(1010, 'Валерия', 'Свидригайло', 45, 'учитель белорусского языка и литературы'),
(1011, 'Александра', 'Маликова', 48, 'повар'),
(1012, 'Василий', 'Дерзкий', 42, 'завхоз'),
(1013, 'Петр', 'Грач', 51, 'дворник'),
(1015, 'Павел', 'Пятницкий', 37, 'учитель математики'),
(1016, 'Надежда', 'Петрова', 40, 'учитель русского языка и литературы'),
(1017, 'Петр', 'Сидоренко', 51, 'дворник'),
(1018, 'Жанна', 'Владимировна', 29, 'учитель физической культуры'),
(1019, 'Петр', 'Афанасьев', 49, 'электрик'),
(1020, 'Раиса', 'Павлова', 51, 'буфетчица'),
(1021, 'Мария', 'Синяя', 29, 'учитель английского языка'),
(1022, 'варпар', 'парпар', 10, 'прлрл'),
(1023, 'варпар', 'парпар', 10, 'прлрл'),
(1024, 'варпар', 'парпар', 10, 'прлрл');

-- --------------------------------------------------------

--
-- Структура таблицы `household_equipment`
--

DROP TABLE IF EXISTS `household_equipment`;
CREATE TABLE IF NOT EXISTS `household_equipment` (
  `id` int(5) NOT NULL AUTO_INCREMENT,
  `Name_of_equipment` varchar(30) CHARACTER SET utf8 DEFAULT NULL,
  `Amount` int(5) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=1239 DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `household_equipment`
--

INSERT INTO `household_equipment` (`id`, `Name_of_equipment`, `Amount`) VALUES
(1101, 'Стол учебный', 300),
(1102, 'Стул учебный', 600),
(1103, 'Лопата', 20),
(1104, 'Стол обеденный', 60),
(1105, 'Дверь', 80),
(1106, 'Грабли', 20),
(1107, 'Стул обеденный', 200),
(1108, 'Вилка', 200),
(1109, 'Ложка', 200),
(1110, 'Тарелка', 200),
(1111, 'Миска', 200),
(1112, 'Стакан', 200),
(1113, 'Лампа', 100),
(1114, 'Салфетница', 50),
(1235, 'паопо', 10),
(1236, 'системный блок', 60),
(1237, 'нлпрл', 10),
(1238, 'нлпрл', 10);

-- --------------------------------------------------------

--
-- Структура таблицы `rights`
--

DROP TABLE IF EXISTS `rights`;
CREATE TABLE IF NOT EXISTS `rights` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `right_value` int(3) NOT NULL,
  `right_title` varchar(45) CHARACTER SET utf8 DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=9 DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `rights`
--

INSERT INTO `rights` (`id`, `right_value`, `right_title`) VALUES
(1, 111, 'admin'),
(2, 222, 'завуч/директор'),
(3, 333, 'учитель физ-ры'),
(4, 444, 'учитель русск. языка'),
(5, 555, 'учитель бел. языка'),
(6, 666, 'учитель ин. языка'),
(7, 777, 'учитель математики'),
(8, 888, 'учитель истории');

-- --------------------------------------------------------

--
-- Структура таблицы `students`
--

DROP TABLE IF EXISTS `students`;
CREATE TABLE IF NOT EXISTS `students` (
  `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT,
  `first_name` varchar(35) CHARACTER SET utf8 NOT NULL,
  `second_name` varchar(35) CHARACTER SET utf8 NOT NULL,
  `birthday` varchar(20) CHARACTER SET utf8 NOT NULL,
  `class` int(2) NOT NULL,
  `letter_of_class` varchar(2) CHARACTER SET utf8 NOT NULL,
  `address` varchar(40) CHARACTER SET utf8 NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=44 DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `students`
--

INSERT INTO `students` (`id`, `first_name`, `second_name`, `birthday`, `class`, `letter_of_class`, `address`) VALUES
(1, 'Александр', 'Петров', '1999-08-12', 11, 'А', 'ул.Гикало,7 кв.28'),
(2, 'Петр', 'Бекмамбетов', '1999-05-13', 11, 'А', 'ул.Гикало,7 кв.26'),
(3, 'Павел', 'Тажединов', '1999-01-25', 11, 'А', 'ул.Пушкина,10 кв.120'),
(4, 'Павел', 'Тимуров', '1999-05-21', 11, 'А', 'ул.Антонова,11 кв.20'),
(5, 'Юрий', 'Матиевский', '2000-10-10', 10, 'А', 'ул.Георгиевская,86 кв.134'),
(6, 'Млада', 'Белозёрова', '2000-10-27', 10, 'А', 'ул.Бакунинская,95 кв.103'),
(7, 'Фаина', 'Тарская', '2000-02-25', 10, 'А', 'ул.Завокзальная 1-я,65 кв.287'),
(8, 'Римма', 'Сергеева', '2000-05-17', 10, 'Б', 'ул.Жёлтиковская 1-я,58 кв.197'),
(9, 'Эмилия', 'Кондратьева', '2000-05-29', 10, 'Б', 'ул.Бараньи горки,21 кв.9'),
(10, 'Роберт', 'Леонов', '2000-06-15', 10, 'Б', 'ул.Басовская,66 кв.158'),
(11, 'Адриан', 'Киселёв', '2000-09-05', 9, 'В', 'ул.Барболина,43 кв.47'),
(12, 'Зоя', 'Фёдорова', '2001-04-23', 9, 'А', 'ул.Сержанта Елизарова,14 кв.269'),
(13, 'Бернар', 'Поляков', '2001-04-15', 8, 'А', 'ул.Басовская,66 кв.158'),
(14, 'Адриан', 'Киселёв', '2001-12-05', 9, 'А', 'ул. Бауманская,5 кв.172'),
(15, 'Конкордия', 'Вихирева', '2001-03-08', 9, 'Б', 'ул.Жёлтиковская 1-я,96 кв.194'),
(16, 'Виталий', 'Козлов', '2001-03-13', 9, 'Б', 'ул.Строителей,60 кв.8'),
(17, 'Глафира', 'Леонтьева', '2001-02-07', 9, 'Б', 'ул.Желябова,17, кв.271'),
(18, 'Стела', 'Леонтьева', '2001-03-15', 9, 'В', 'ул.Королёва,54 кв.139'),
(19, 'Людмила', 'Дмитриева', '2001-06-24', 9, 'В', 'ул.Авангардная,91 кв.185'),
(20, 'Софья', 'Герасимова', '2001-05-07', 9, 'В', 'ул.Бадюлина,6 кв.147'),
(21, 'Леонид', 'Петров', '2002-04-08', 8, 'А', 'ул.Заречная,61 кв.38'),
(22, 'Марк', 'Русов', '2002-09-01', 8, 'А', 'ул.Авиаконструктора Миля,85 кв.8'),
(23, 'Лилиана', 'Арджеванидзе', '2002-09-13', 8, 'А', 'ул.Бабаевская улица,21 кв.26'),
(24, 'Пахом', 'Чаурин', '2002-01-17', 8, 'Б', 'ул.Александра Завидова,22 кв.152'),
(25, 'Пульхерия', 'Сергеева', '2002-10-24', 8, 'Б', 'ул.Маяковского,58 кв.147'),
(26, 'Элла', 'Прокофьева', '2002-10-07', 8, 'Б', 'ул. Садовая,80 кв.256'),
(27, 'Фока', 'Герасимов', '2002-08-08', 8, 'В', 'ул.Беговая 4-я,35 кв.132'),
(28, 'Фортунат', 'Охота', '2002-09-11', 8, 'В', 'ул.Авиаконструктора Миля,84 кв.10'),
(29, 'Олег', 'Поляков', '2002-01-13', 8, 'В', 'ул.Сталина,58 кв.261'),
(30, 'Станислава', 'Яковлева', '2003-01-15', 7, 'А', 'ул.Барышиха,80 кв.239'),
(31, 'Филарет', 'Шульц', '2003-12-24', 7, 'А', 'ул.Авиаконструктора Миля,8 кв.130'),
(32, 'Лариса', 'Журавель', '2003-03-07', 7, 'А', 'ул.Голландская,7 кв.233'),
(33, 'Элла', 'Усачёва', '2003-03-19', 7, 'Б', 'ул.Хрущёва,80 кв.199'),
(34, 'Евгений', 'Козырев', '2003-09-21', 7, 'Б', 'ул.Барвихинская,55 кв.219'),
(35, 'Макар', 'Муравьев', '2003-07-30', 7, 'Б', 'ул.Бабаевская улица,46 кв.285'),
(36, 'Бронислав', 'Усачёв', '2003-08-24', 7, 'В', 'ул.Бабаевская улица,79 кв.120'),
(37, 'Мирослава', 'Тарская', '2003-03-23', 7, 'В', 'ул.Академическая,17 кв.248'),
(38, 'Вячеслав', 'Васильев', '2003-07-17', 7, 'В', 'ул.Бауманская,32 кв.129'),
(40, 'Василий', 'Петрович', '2004-01-26', 6, 'А', 'ул.Дерна,15 кв.190'),
(39, 'Black', 'Star', '2004-05-10', 6, 'А', 'ул.Чёрных фонарей,14 кв.147'),
(41, 'Василиса', 'Панина', '2004-09-26', 6, 'А', 'ул.Деревянная,25 кв.19'),
(43, 'Александр', 'Сергеев', '2000-05-25', 8, 'Г', 'ул. Пульмана,44 кв. 86');

-- --------------------------------------------------------

--
-- Структура таблицы `student_progress`
--

DROP TABLE IF EXISTS `student_progress`;
CREATE TABLE IF NOT EXISTS `student_progress` (
  `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT,
  `Maths` int(2) DEFAULT '0',
  `Russian` int(2) DEFAULT '0',
  `Belarussian` int(2) DEFAULT '0',
  `Russian_literature` int(2) DEFAULT '0',
  `Belarussian_literature` int(2) DEFAULT '0',
  `Physical_culture` int(2) DEFAULT '0',
  `Foreign_language` int(2) DEFAULT '0',
  `History` int(2) DEFAULT '0',
  `Average_value` float DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=44 DEFAULT CHARSET=latin1;

--
-- Дамп данных таблицы `student_progress`
--

INSERT INTO `student_progress` (`id`, `Maths`, `Russian`, `Belarussian`, `Russian_literature`, `Belarussian_literature`, `Physical_culture`, `Foreign_language`, `History`, `Average_value`) VALUES
(1, 7, 6, 6, 7, 7, 9, 8, 8, 7.25),
(2, 6, 6, 6, 7, 6, 9, 8, 8, 7),
(3, 9, 5, 6, 7, 7, 10, 8, 8, 7.5),
(4, 7, 6, 6, 7, 7, 9, 8, 8, 7.25),
(5, 9, 9, 9, 9, 9, 6, 9, 6, 8.25),
(6, 9, 8, 7, 8, 8, 6, 8, 8, 7.75),
(7, 4, 9, 9, 9, 9, 10, 9, 7, 8.25),
(8, 9, 9, 9, 9, 9, 6, 9, 6, 8.25),
(9, 6, 6, 6, 6, 7, 7, 7, 7, 6.5),
(10, 9, 8, 9, 9, 5, 6, 9, 6, 7.625),
(11, 3, 4, 4, 5, 5, 10, 4, 6, 5.125),
(12, 5, 5, 5, 7, 7, 9, 6, 8, 6.5),
(13, 6, 7, 7, 8, 8, 9, 7, 8, 7.5),
(14, 8, 8, 8, 8, 8, 9, 9, 9, 8.375),
(15, 8, 9, 5, 7, 8, 9, 9, 9, 8),
(16, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(17, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(18, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(19, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(20, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(21, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(22, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(23, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(24, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(25, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(26, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(27, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(28, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(29, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(30, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(31, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(32, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(33, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(34, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(35, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(36, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(37, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(38, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(39, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(40, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(41, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(43, 0, 0, 0, 0, 0, 0, 0, 0, 0);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
